maxgerhardt/micropython/ports/ch32/boot_v3f/main.c
/* V3F boot stub for the CH32H417.
 *
 * Its entire job is to configure the clock tree and hand control to the V5F,
 * which runs MicroPython. It then sleeps and never runs again.
 *
 * USART1 output here is deliberately minimal but not absent: without it, a
 * failure to wake the V5F is indistinguishable from a dead board. */
#include "ch32h417.h"
#include "system_ch32h417.h"

#ifndef CH32_V5F_START_ADDR
#error "CH32_V5F_START_ADDR must be defined (see coreboot.mk)"
#endif

static void uart1_init(uint32_t baud) {
    GPIO_InitTypeDef gpio = {0};
    USART_InitTypeDef usart = {0};

    /* AFIO clock is required or the GPIO_PinAFConfig writes are dropped. */
    RCC_HB2PeriphClockCmd(RCC_HB2Periph_GPIOA | RCC_HB2Periph_USART1
        | RCC_HB2Periph_AFIO, ENABLE);
    /* The H417 uses an STM32F4-style AF mux: USART1 is AF7 on PA9/PA10. */
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF7);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF7);

    gpio.GPIO_Pin = GPIO_Pin_9;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    gpio.GPIO_Speed = GPIO_Speed_High;
    GPIO_Init(GPIOA, &gpio);
    gpio.GPIO_Pin = GPIO_Pin_10;
    GPIO_Init(GPIOA, &gpio);

    usart.USART_BaudRate = baud;
    usart.USART_WordLength = USART_WordLength_8b;
    usart.USART_StopBits = USART_StopBits_1;
    usart.USART_Parity = USART_Parity_No;
    usart.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    usart.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    USART_Init(USART1, &usart);
    USART_Cmd(USART1, ENABLE);
}

static void uart1_puts(const char *s) {
    while (*s) {
        if (*s == '\n') {
            while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET) {
            }
            USART_SendData(USART1, '\r');
        }
        while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET) {
        }
        USART_SendData(USART1, (uint16_t)(uint8_t)*s++);
    }
}

int main(void) {
    SystemInit();                 /* configures every PLL; the V5F must NOT repeat this */
    SystemAndCoreClockUpdate();
    uart1_init(115200);

    uart1_puts("\nV3F: waking V5F\n");

    /* The address is masked with ~0x3FF inside, so it must be 1 KB aligned. */
    NVIC_WakeUp_V5F(CH32_V5F_START_ADDR);

    RCC_HB1PeriphClockCmd(RCC_HB1Periph_PWR, ENABLE);
    PWR_EnterSTOPMode(PWR_Regulator_ON, PWR_STOPEntry_WFE);

    /* Not normally reached: the core parks in the WFI inside
     * PWR_EnterSTOPMode() and stays there. Verified by halting
     * wch_riscv.cpu.0 over SWD while MicroPython runs -- the V3F's PC reads
     * 0x20100e82 every time, the instruction after that WFI.
     *
     * It is still reachable in principle, because that helper returns once a
     * wake source fires, and a `nop` loop here would then spin the core at
     * full clock forever. WFI costs nothing and cannot do that. */
    /* Re-enter, rather than a bare __WFI(). machine.deepsleep() on the V5F
     * relies on this core permanently requesting Stop -- RM 2.3, "the stop
     * mode only takes effect when both V3F and V5F enter stop mode" -- and
     * PWR_EnterSTOPMode() clears its own SLEEPDEEP on the way out. A plain
     * WFI here would leave this core in shallow sleep after any wake, and
     * deepsleep would silently degrade to Sleep mode from then on: still
     * correct, but no longer saving the power that is the whole point. */
    for (;;) {
        PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFE);
    }
}
